tap "ethereum/ethereum"
tap "fsouza/prettierd"
tap "grishka/grishka"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hyperledger/solang"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "libsql/sqld"
tap "microsoft/git"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "sst/tap"
tap "stripe/stripe-cli"
tap "tursodatabase/tap"
tap "wez/wezterm"
# Simple, modern, secure file encryption
brew "age"
# Library and utilities for processing GIFs
brew "giflib"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Version manager for neovim
brew "bob"
# Modern, simple TCP tunnel in Rust that exposes local ports to a remote server
brew "bore-cli"
# New way to see and navigate directory trees
brew "broot"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Binary installation for rust projects
brew "cargo-binstall"
# Object-file caching compiler wrapper
brew "ccache"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# More intuitive version of du in rust
brew "dust"
# Soft fork of the helix editor
brew "evil-helix", link: false
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Formatter for Fennel code
brew "fnlfmt"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Perfect hash function generator
brew "gperf"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Git-compatible distributed version control system
brew "jj"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Implementation of the file(1) command
brew "libmagic"
# Library to render SVG files using Cairo
brew "librsvg"
# Package manager for the Lua programming language
brew "luarocks"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern replacement for ps written in Rust
brew "procs"
# Pluggable multi-language version manager
brew "proto"
# Cloud native development platform
brew "pulumi"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Contract-oriented programming language
brew "solidity"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# General purpose fuzzy finder TUI
brew "television"
# Program that allows you to count code, quickly
brew "tokei"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# Yet Another Dotfiles Manager
brew "yadm"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
brew "tursodatabase/tap/turso"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal-based AI coding assistant
cask "claude-code"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Multi-platform multi-messaging app
cask "ferdium"
# Collaborative team software
cask "figma"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-fira-code"
cask "font-google-sans-code"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty@tip"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Neovim GUI written in Golang, using a Golang qt backend
cask "goneovim"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# Vector graphics editor
cask "inkscape"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Unofficial Google Nearby Share app
cask "grishka/grishka/neardrop"
# Developer IDE or Management Environment for Neo4j instances
cask "neo4j-desktop"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Command-line tools for Nordic nRF Semiconductors
cask "nordic-nrf-command-line-tools"
# Unified CLI utility for Nordic Semiconductor products
cask "nrfutil"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Window snapping tool
cask "rectangle-pro"
# Software and Documentation pack for Segger J-Link debug probes
cask "segger-jlink"
# Collection of apps available by subscription
cask "setapp"
# Solidity Compiler for Solana and Substrate
cask "hyperledger/solang/solang"
# Open source cross-platform file explorer
cask "spacedrive"
# Music streaming service
cask "spotify"
cask "switchkey"
# Messaging app with a focus on speed and security
cask "telegram"
# Unicode keyboard layout editor
cask "ukelele"
# AI image upscaler
cask "upscayl"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
