tap "ethereum/ethereum"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "hyperledger/solang"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "libsql/sqld"
tap "microsoft/git"
tap "ngrok/ngrok"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "stripe/stripe-cli"
tap "tursodatabase/tap"
# Simple, modern, secure file encryption
brew "age"
# Library and utilities for processing GIFs
brew "giflib"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, simple TCP tunnel in Rust that exposes local ports to a remote server
brew "bore-cli"
# New way to see and navigate directory trees
brew "broot"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image manipulation library
brew "jq"
# Terminal file manager
brew "lf"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Object-relational database system
brew "postgresql@14"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Cloud native development platform
brew "pulumi"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Contract-oriented programming language
brew "solidity"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# Program that allows you to count code, quickly
brew "tokei"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Tool for writing better scripts
brew "zx"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
brew "tursodatabase/tap/turso"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# App to build and share containerised applications and microservices
cask "docker"
# Collaborative team software
# cask "figma"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Neovim GUI written in Golang, using a Golang qt backend
# cask "goneovim"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Developer IDE or Management Environment for Neo4j instances
cask "neo4j"
# Neovim Client
cask "neovide"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle-pro"
# Collection of apps available by subscription
cask "setapp"
# Solidity Compiler for Solana and Substrate
cask "solang"
cask "switchkey"
# Messaging app with a focus on speed and security
cask "telegram"
# Unicode keyboard layout editor
# cask "ukelele"
# Open-source code editor
cask "visual-studio-code"
