brew "git"
brew "zsh"

cask "rectangle"
cask "karabiner-elements"
cask "kitty"
# cask "alfred"
cask "docker"
cask "google-chrome"
cask "telegram"
cask "raycast"
cask "ukelele"

#cask "vimac"

cask "visual-studio-code"
cask "setapp"

tap "homebrew/cask-drivers"
cask "qmk-toolbox"

cask "obsidian"
cask "figma"
#cask "firefox-developer-edition"
cask "meetingbar"

tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
cask "font-fira-code"

tap "microsoft/git"
cask "git-credential-manager-core"

cask "mos"

# brew "alt-tab"

brew "neovim"
brew "broot"
brew "zx"
brew "jq"

brew "sops"
brew "gh"
brew "git-lfs"
brew "gnu-sed"

# brew "autojump"
brew "zoxide"

brew "fzf"
brew "fd"
brew "ripgrep"
brew "bat"
brew "exa"
brew "tokei"
brew "htop"

brew "lf"

brew "rust"
brew "fnm"
brew "deno"

brew "postgresql"
brew "pulumi"

brew "git-delta"
brew "jesseduffield/lazygit/lazygit"

brew "koekeishiya/formulae/yabai"

# brew "qmk/qmk/qmk"
